In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('csv_files/file1.csv')
df2 = pd.read_csv('csv_files/file2.csv')
df3 = pd.read_csv('csv_files/file3.csv')

In [3]:
display(df1.head(1))
display(df2.head(1))
display(df3.head(1))

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [4]:
df2.dtypes

Customer                      object
ST                            object
GENDER                        object
Education                     object
Customer Lifetime Value       object
Income                         int64
Monthly Premium Auto           int64
Number of Open Complaints     object
Total Claim Amount           float64
Policy Type                   object
Vehicle Class                 object
dtype: object

In [5]:
df2.shape

(996, 11)

In [6]:
df3.shape

(7070, 11)

In [7]:
df1.isnull().sum()

Customer                     2937
ST                           2937
GENDER                       3054
Education                    2937
Customer Lifetime Value      2940
Income                       2937
Monthly Premium Auto         2937
Number of Open Complaints    2937
Policy Type                  2937
Vehicle Class                2937
Total Claim Amount           2937
dtype: int64

In [8]:
cols1 = []
for column in df1.columns:
    cols1.append(column.lower())
df1.columns = cols1


cols2 = []
for column in df2.columns:
    cols2.append(column.lower())
df2.columns = cols2
    
    
cols3 = []
for column in df3.columns:
    cols3.append(column.lower())
df3.columns = cols3

In [9]:
df1['customer lifetime value'] = pd.to_numeric(df1['customer lifetime value'], errors='coerce')
df2['customer lifetime value'] = pd.to_numeric(df2['customer lifetime value'], errors='coerce')

In [10]:
display(df1.head(4))
display(df2.head(4))
display(df3.head(4))

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,NaN,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,NaN,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,NaN,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,total claim amount,policy type,vehicle class
0,GS98873,Arizona,F,Bachelor,NaN,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,NaN,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,NaN,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,NaN,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car

,customer,state,customer lifetime value,education,gender,income,monthly premium auto,number of open complaints,policy type,total claim amount,vehicle class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV

In [11]:
df1.columns == df2.columns

array([ True,  True,  True,  True,  True,  True,  True,  True, False,
       False, False])

In [12]:
df2.columns == df3.columns

array([ True, False, False,  True, False,  True,  True,  True, False,
       False,  True])

In [13]:
#rename columns in df1, df2 (st = state)

df1 = df1.rename(columns={'st':'state'})
df2 = df2.rename(columns={'st':'state'})

In [14]:
#re-order columns
df2 = df2[['customer','state','gender','education','customer lifetime value','income','monthly premium auto','number of open complaints','policy type','vehicle class','total claim amount']]
df3 = df3[['customer','state','gender','education','customer lifetime value','income','monthly premium auto','number of open complaints','policy type','vehicle class','total claim amount']]

In [15]:
#concat

complete = pd.concat([df1,df2,df3], axis=0)
complete.shape

(12074, 11)

In [16]:
complete.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer lifetime value      float64
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

In [17]:
complete = complete.drop(columns=['education','number of open complaints'])

In [18]:
complete.shape

(12074, 9)

In [19]:
complete['customer lifetime value'] = complete['customer lifetime value'].fillna(0)

In [20]:
complete['customer lifetime value'] = complete['customer lifetime value']*100

In [21]:
complete.head(10)

,customer,state,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,0.0,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,0.0,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,0.0,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,0.0,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,0.0,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,0.0,62902.0,69.0,Personal Auto,Two-Door Car,159.383042
6,XZ87318,Oregon,F,0.0,55350.0,67.0,Corporate Auto,Four-Door Car,321.600000
7,CF85061,Arizona,M,0.0,0.0,101.0,Corporate Auto,Four-Door Car,363.029680
8,DY87989,Oregon,M,0.0,14072.0,71.0,Corporate Auto,Four-Door Car,511.200000
9,BQ94931,Oregon,F,0.0,28812.0,93.0,Special Auto,Four-Door Car,425.527834

In [22]:
complete.duplicated().sum()

2939

In [23]:
complete = complete.drop_duplicates()
complete.shape

(9135, 9)

In [26]:
complete['customer lifetime value'] = (complete['customer lifetime value']).astype(int)
complete.describe()

,customer lifetime value,income,monthly premium auto,total claim amount
count,9.135000e+03,9134.000000,9134.000000,9134.000000
mean,6.213860e+05,37824.847055,110.393146,430.480412
std,6.969925e+05,30359.232933,581.471461,289.617985
min,0.000000e+00,0.000000,61.000000,0.099007
25%,2.402250e+05,0.000000,68.000000,266.961153
50%,4.846320e+05,34240.000000,83.000000,377.505619
75%,8.093380e+05,62446.500000,109.000000,546.050821
max,8.332538e+06,99981.000000,35354.000000,2893.239678

In [27]:
complete1 = complete[complete['income']>0]

In [28]:
complete1.shape

(6840, 9)

In [30]:
complete1.head()

,customer,state,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
2,AI49188,Nevada,F,0,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
4,GA49547,Washington,M,0,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
5,OC83172,Oregon,F,0,62902.0,69.0,Personal Auto,Two-Door Car,159.383042
6,XZ87318,Oregon,F,0,55350.0,67.0,Corporate Auto,Four-Door Car,321.600000
8,DY87989,Oregon,M,0,14072.0,71.0,Corporate Auto,Four-Door Car,511.200000

In [31]:
complete.to_csv('Clean.csv', index = False)